#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/aws-mlops-infra/runs/run-i6UaHe7xWjxgBoXz

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_vpc.demo: Refreshing state... [id=vpc-0e9d2c33cbeb9ab85]
aws_iam_role.demo-node: Refreshing state... [id=terraform-eks-demo-node]
aws_iam_role.demo-cluster: Refreshing state... [id=terraform-eks-demo-cluster]
aws_iam_role_policy_attachment.demo-node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=terraform-eks-demo-node-20210824073501837500000003]
aws_iam_role_policy_attachment.demo-node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=terraform-eks-demo-node-20210824073501837000000002]
aws_iam_role_policy_attachment.demo-cluster-AmazonEKSClusterPolicy: Refreshing state... [id=terraform-eks-demo-cluster-20210824073501847100000004]
aws_iam_role_policy_attachment.demo-cluster-AmazonEKSVPCResourceController: Refreshing state... [id=terraform-eks-demo-cluster-20210824073501872300000005]
aws_iam_role_policy_attachment.demo-node-AmazonEKS_CNI_Policy: Refreshing state... [id=terraform-eks-demo-node-20210824073501836700000001]
aws_internet_gateway.demo: Refreshing state... [id=igw-06f03b316d06e4bea]
aws_subnet.demo[0]: Refreshing state... [id=subnet-0288c11b7f9e50e5d]
aws_subnet.demo[1]: Refreshing state... [id=subnet-0104b1820419fcf43]
aws_security_group.demo-cluster: Refreshing state... [id=sg-0406d098e203a33f5]
aws_route_table.demo: Refreshing state... [id=rtb-08c1ae1da42983f21]
aws_eks_cluster.demo: Refreshing state... [id=terraform-eks-demo]
aws_security_group_rule.demo-cluster-ingress-workstation-https: Refreshing state... [id=sgrule-2591866206]
aws_route_table_association.demo[0]: Refreshing state... [id=rtbassoc-0184df795d36831b5]
aws_route_table_association.demo[1]: Refreshing state... [id=rtbassoc-08cb0ed24a6a54cf4]
aws_eks_node_group.demo: Refreshing state... [id=terraform-eks-demo:demo]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_route_table_association.demo[0] has been deleted
  - resource "aws_route_table_association" "demo" {
      - id             = "rtbassoc-0184df795d36831b5" -> null
      - route_table_id = "rtb-08c1ae1da42983f21" -> null
      - subnet_id      = "subnet-0288c11b7f9e50e5d" -> null
    }
  # aws_route_table_association.demo[1] has been deleted
  - resource "aws_route_table_association" "demo" {
      - id             = "rtbassoc-08cb0ed24a6a54cf4" -> null
      - route_table_id = "rtb-08c1ae1da42983f21" -> null
      - subnet_id      = "subnet-0104b1820419fcf43" -> null
    }
  # aws_eks_cluster.demo has been deleted
  - resource "aws_eks_cluster" "demo" {
      - arn                   = "arn:aws:eks:us-west-2:112227029085:cluster/terraform-eks-demo" -> null
      - certificate_authority = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREEzTkRJMU0xb1hEVE14TURneU1qQTNOREkxTTFvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTTFGCmF2dElCWHd2S2ZOL0tKY3NNWHNkaWlhc3pPRnM5NFJHMVZZbHdZNmlocnl1QVpDVGNCWHd5dFo5RHVTOXhwb2oKa09qd0p3U1k5anRBQm9QNGpXZ3NlUUw3dFZoSE85UEhyUXpBVURjcjQ4UlVWV0FlR202NldNTFB6QzdwdUphOApvL2VkUXZSaU4vTUJaRDlZZEhSUEdXOVhtNERFelNMZ3A1ci9kUlRod0g1a0ZDZXA1V2laMHp4UnphcWxNTnlmCk5SSG8zVGFITHkzcTFPcXNveWlKOWp0SGp3bSsrYXZPY1FPcmRrUzZPNDNZeWZtZTdVZ1djS1BkYWtLSGNDYk8KUnhmMnpiU1gwUk1JWFgxUjZqdlltNmVEcHhsMy9kcDJVNzhIT2FjVVVxNVhuTXJ2YmRoQzFpblZMWUVZa0ZqbwpmRWtmdEJhQmhmNVQzOVBhTUZjQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZFTVdkZUNaNVUwQy8zM2w0dG01RkxYVTB5ZVNNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCeDhBaVNISWFrYWEwRXBQUkpzZmo1QnlkVjcyclVMclhjeHVLSFpMbHJ5c1hhU0dXQQo3bEY0a21Xb3hLR20rM2NmbjJ1Um1lYUlrek9oT29WZzIvMHIwcFhTSVIzYnZyTWdKWGN5UGpteFphOWt3cXpSCmwwY2lyV3JXTlZNSlY1OWlOWE85eHlsYkhJTVYrY0xIWlE0bmU4RURidkNrN0lWRXpnYUl5RmZneHRTdWxwV28KWmxqald4U2M3S2U0WnZxR0UwdlM4YXprUy9DaVZadkR1dG1RWGNLVTFuOFZWWUI3WXBHRUIvdHE3cG1iMFIycwpzSForZU1NbTRERVhYdmZ5YVVBaGNVOFphVFY1RHJrbkhoU1k0VjRweTB1K0t2dVIveUpMdFhjZ2VoSG92S3BhCk5LZk5IWVgrQUp5ekE4S2tvamRybkVzQVpDcGIvRm4wUnE1WQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> null
      - created_at            = "2021-08-24 07:35:17.615 +0000 UTC" -> null
      - endpoint              = "https://ED9051243D16DDA7B46463ED5B5DDE1C.gr7.us-west-2.eks.amazonaws.com" -> null
      - id                    = "terraform-eks-demo" -> null
      - identity              = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-west-2.amazonaws.com/id/ED9051243D16DDA7B46463ED5B5DDE1C"
                    },
                ]
            },
        ] -> null
      - name                  = "terraform-eks-demo" -> null
      - platform_version      = "eks.2" -> null
      - role_arn              = "arn:aws:iam::112227029085:role/terraform-eks-demo-cluster" -> null
      - status                = "ACTIVE" -> null
      - tags_all              = {} -> null
      - version               = "1.20" -> null

      - kubernetes_network_config {
          - service_ipv4_cidr = "172.20.0.0/16" -> null
        }

      - vpc_config {
          - cluster_security_group_id = "sg-08a7fde24e8d0116f" -> null
          - endpoint_private_access   = false -> null
          - endpoint_public_access    = true -> null
          - public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> null
          - security_group_ids        = [
              - "sg-0406d098e203a33f5",
            ] -> null
          - subnet_ids                = [
              - "subnet-0104b1820419fcf43",
              - "subnet-0288c11b7f9e50e5d",
            ] -> null
          - vpc_id                    = "vpc-0e9d2c33cbeb9ab85" -> null
        }
    }
  # aws_security_group_rule.demo-cluster-ingress-workstation-https has been deleted
  - resource "aws_security_group_rule" "demo-cluster-ingress-workstation-https" {
      - cidr_blocks       = [
          - "34.205.171.34/32",
        ] -> null
      - description       = "Allow workstation to communicate with the cluster API Server" -> null
      - from_port         = 443 -> null
      - id                = "sgrule-2591866206" -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0406d098e203a33f5" -> null
      - self              = false -> null
      - to_port           = 443 -> null
      - type              = "ingress" -> null
    }
  # aws_eks_node_group.demo has been deleted
  - resource "aws_eks_node_group" "demo" {
      - ami_type        = "AL2_x86_64" -> null
      - arn             = "arn:aws:eks:us-west-2:112227029085:nodegroup/terraform-eks-demo/demo/a6bdbb90-902c-be7a-b210-4cc453509e69" -> null
      - capacity_type   = "ON_DEMAND" -> null
      - cluster_name    = "terraform-eks-demo" -> null
      - disk_size       = 20 -> null
      - id              = "terraform-eks-demo:demo" -> null
      - instance_types  = [
          - "t3.medium",
        ] -> null
      - node_group_name = "demo" -> null
      - node_role_arn   = "arn:aws:iam::112227029085:role/terraform-eks-demo-node" -> null
      - release_version = "1.20.4-20210813" -> null
      - resources       = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-a6bdbb90-902c-be7a-b210-4cc453509e69"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> null
      - status          = "ACTIVE" -> null
      - subnet_ids      = [
          - "subnet-0104b1820419fcf43",
          - "subnet-0288c11b7f9e50e5d",
        ] -> null
      - tags_all        = {} -> null
      - version         = "1.20" -> null

      - scaling_config {
          - desired_size = 1 -> null
          - max_size     = 1 -> null
          - min_size     = 1 -> null
        }
    }
  # aws_subnet.demo[0] has been deleted
  - resource "aws_subnet" "demo" {
      - arn                             = "arn:aws:ec2:us-west-2:112227029085:subnet/subnet-0288c11b7f9e50e5d" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-west-2a" -> null
      - availability_zone_id            = "usw2-az2" -> null
      - cidr_block                      = "10.0.0.0/24" -> null
      - id                              = "subnet-0288c11b7f9e50e5d" -> null
      - map_customer_owned_ip_on_launch = false -> null
      - map_public_ip_on_launch         = true -> null
      - owner_id                        = "112227029085" -> null
      - tags                            = {
          - "Name"                                     = "terraform-eks-demo-node"
          - "kubernetes.io/cluster/terraform-eks-demo" = "shared"
        } -> null
      - tags_all                        = {
          - "Name"                                     = "terraform-eks-demo-node"
          - "kubernetes.io/cluster/terraform-eks-demo" = "shared"
        } -> null
      - vpc_id                          = "vpc-0e9d2c33cbeb9ab85" -> null
    }
  # aws_subnet.demo[1] has been deleted
  - resource "aws_subnet" "demo" {
      - arn                             = "arn:aws:ec2:us-west-2:112227029085:subnet/subnet-0104b1820419fcf43" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-west-2b" -> null
      - availability_zone_id            = "usw2-az1" -> null
      - cidr_block                      = "10.0.1.0/24" -> null
      - id                              = "subnet-0104b1820419fcf43" -> null
      - map_customer_owned_ip_on_launch = false -> null
      - map_public_ip_on_launch         = true -> null
      - owner_id                        = "112227029085" -> null
      - tags                            = {
          - "Name"                                     = "terraform-eks-demo-node"
          - "kubernetes.io/cluster/terraform-eks-demo" = "shared"
        } -> null
      - tags_all                        = {
          - "Name"                                     = "terraform-eks-demo-node"
          - "kubernetes.io/cluster/terraform-eks-demo" = "shared"
        } -> null
      - vpc_id                          = "vpc-0e9d2c33cbeb9ab85" -> null
    }
  # aws_route_table.demo has been deleted
  - resource "aws_route_table" "demo" {
      - arn              = "arn:aws:ec2:us-west-2:112227029085:route-table/rtb-08c1ae1da42983f21" -> null
      - id               = "rtb-08c1ae1da42983f21" -> null
      - owner_id         = "112227029085" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-06f03b316d06e4bea"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags_all         = {} -> null
      - vpc_id           = "vpc-0e9d2c33cbeb9ab85" -> null
    }
  # aws_iam_role.demo-cluster has been changed
  ~ resource "aws_iam_role" "demo-cluster" {
        id                    = "terraform-eks-demo-cluster"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          + "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ]
        name                  = "terraform-eks-demo-cluster"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_vpc.demo has been deleted
  - resource "aws_vpc" "demo" {
      - arn                              = "arn:aws:ec2:us-west-2:112227029085:vpc/vpc-0e9d2c33cbeb9ab85" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-010de76e7ca40fd03" -> null
      - default_route_table_id           = "rtb-0bca7d50987a7baa9" -> null
      - default_security_group_id        = "sg-04b460c3f4b921fb5" -> null
      - dhcp_options_id                  = "dopt-b87715c0" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = false -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0e9d2c33cbeb9ab85" -> null
      - instance_tenancy                 = "default" -> null
      - main_route_table_id              = "rtb-0bca7d50987a7baa9" -> null
      - owner_id                         = "112227029085" -> null
      - tags                             = {
          - "Name"                                     = "terraform-eks-demo-node"
          - "kubernetes.io/cluster/terraform-eks-demo" = "shared"
        } -> null
      - tags_all                         = {
          - "Name"                                     = "terraform-eks-demo-node"
          - "kubernetes.io/cluster/terraform-eks-demo" = "shared"
        } -> null
    }
  # aws_iam_role.demo-node has been changed
  ~ resource "aws_iam_role" "demo-node" {
        id                    = "terraform-eks-demo-node"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          + "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          + "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ]
        name                  = "terraform-eks-demo-node"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_security_group.demo-cluster has been deleted
  - resource "aws_security_group" "demo-cluster" {
      - arn                    = "arn:aws:ec2:us-west-2:112227029085:security-group/sg-0406d098e203a33f5" -> null
      - description            = "Cluster communication with worker nodes" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0406d098e203a33f5" -> null
      - ingress                = [] -> null
      - name                   = "terraform-eks-demo-cluster" -> null
      - owner_id               = "112227029085" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "terraform-eks-demo"
        } -> null
      - tags_all               = {
          - "Name" = "terraform-eks-demo"
        } -> null
      - vpc_id                 = "vpc-0e9d2c33cbeb9ab85" -> null
    }
  # aws_internet_gateway.demo has been deleted
  - resource "aws_internet_gateway" "demo" {
      - arn      = "arn:aws:ec2:us-west-2:112227029085:internet-gateway/igw-06f03b316d06e4bea" -> null
      - id       = "igw-06f03b316d06e4bea" -> null
      - owner_id = "112227029085" -> null
      - tags     = {
          - "Name" = "terraform-eks-demo"
        } -> null
      - tags_all = {
          - "Name" = "terraform-eks-demo"
        } -> null
      - vpc_id   = "vpc-0e9d2c33cbeb9ab85" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.demo will be created
  + resource "aws_eks_cluster" "demo" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "terraform-eks-demo"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::112227029085:role/terraform-eks-demo-cluster"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.demo will be created
  + resource "aws_eks_node_group" "demo" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "terraform-eks-demo"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "demo"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::112227029085:role/terraform-eks-demo-node"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }
    }

  # aws_internet_gateway.demo will be created
  + resource "aws_internet_gateway" "demo" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "terraform-eks-demo"
        }
      + tags_all = {
          + "Name" = "terraform-eks-demo"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.demo will be created
  + resource "aws_route_table" "demo" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.demo[0] will be created
  + resource "aws_route_table_association" "demo" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.demo[1] will be created
  + resource "aws_route_table_association" "demo" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.demo-cluster will be created
  + resource "aws_security_group" "demo-cluster" {
      + arn                    = (known after apply)
      + description            = "Cluster communication with worker nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "terraform-eks-demo-cluster"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "terraform-eks-demo"
        }
      + tags_all               = {
          + "Name" = "terraform-eks-demo"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.demo-cluster-ingress-workstation-https will be created
  + resource "aws_security_group_rule" "demo-cluster-ingress-workstation-https" {
      + cidr_blocks              = [
          + "18.216.92.46/32",
        ]
      + description              = "Allow workstation to communicate with the cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_subnet.demo[0] will be created
  + resource "aws_subnet" "demo" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-southeast-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                                     = "terraform-eks-demo-node"
          + "kubernetes.io/cluster/terraform-eks-demo" = "shared"
        }
      + tags_all                        = {
          + "Name"                                     = "terraform-eks-demo-node"
          + "kubernetes.io/cluster/terraform-eks-demo" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.demo[1] will be created
  + resource "aws_subnet" "demo" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-southeast-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                                     = "terraform-eks-demo-node"
          + "kubernetes.io/cluster/terraform-eks-demo" = "shared"
        }
      + tags_all                        = {
          + "Name"                                     = "terraform-eks-demo-node"
          + "kubernetes.io/cluster/terraform-eks-demo" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.demo will be created
  + resource "aws_vpc" "demo" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name"                                     = "terraform-eks-demo-node"
          + "kubernetes.io/cluster/terraform-eks-demo" = "shared"
        }
      + tags_all                         = {
          + "Name"                                     = "terraform-eks-demo-node"
          + "kubernetes.io/cluster/terraform-eks-demo" = "shared"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ kubeconfig = <<-EOT
        
        
        apiVersion: v1
        clusters:
        - cluster:
            server: https://ED9051243D16DDA7B46463ED5B5DDE1C.gr7.us-west-2.eks.amazonaws.com
            certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREEzTkRJMU0xb1hEVE14TURneU1qQTNOREkxTTFvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTTFGCmF2dElCWHd2S2ZOL0tKY3NNWHNkaWlhc3pPRnM5NFJHMVZZbHdZNmlocnl1QVpDVGNCWHd5dFo5RHVTOXhwb2oKa09qd0p3U1k5anRBQm9QNGpXZ3NlUUw3dFZoSE85UEhyUXpBVURjcjQ4UlVWV0FlR202NldNTFB6QzdwdUphOApvL2VkUXZSaU4vTUJaRDlZZEhSUEdXOVhtNERFelNMZ3A1ci9kUlRod0g1a0ZDZXA1V2laMHp4UnphcWxNTnlmCk5SSG8zVGFITHkzcTFPcXNveWlKOWp0SGp3bSsrYXZPY1FPcmRrUzZPNDNZeWZtZTdVZ1djS1BkYWtLSGNDYk8KUnhmMnpiU1gwUk1JWFgxUjZqdlltNmVEcHhsMy9kcDJVNzhIT2FjVVVxNVhuTXJ2YmRoQzFpblZMWUVZa0ZqbwpmRWtmdEJhQmhmNVQzOVBhTUZjQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZFTVdkZUNaNVUwQy8zM2w0dG01RkxYVTB5ZVNNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCeDhBaVNISWFrYWEwRXBQUkpzZmo1QnlkVjcyclVMclhjeHVLSFpMbHJ5c1hhU0dXQQo3bEY0a21Xb3hLR20rM2NmbjJ1Um1lYUlrek9oT29WZzIvMHIwcFhTSVIzYnZyTWdKWGN5UGpteFphOWt3cXpSCmwwY2lyV3JXTlZNSlY1OWlOWE85eHlsYkhJTVYrY0xIWlE0bmU4RURidkNrN0lWRXpnYUl5RmZneHRTdWxwV28KWmxqald4U2M3S2U0WnZxR0UwdlM4YXprUy9DaVZadkR1dG1RWGNLVTFuOFZWWUI3WXBHRUIvdHE3cG1iMFIycwpzSForZU1NbTRERVhYdmZ5YVVBaGNVOFphVFY1RHJrbkhoU1k0VjRweTB1K0t2dVIveUpMdFhjZ2VoSG92S3BhCk5LZk5IWVgrQUp5ekE4S2tvamRybkVzQVpDcGIvRm4wUnE1WQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
          name: kubernetes
        contexts:
        - context:
            cluster: kubernetes
            user: aws
          name: aws
        current-context: aws
        kind: Config
        preferences: {}
        users:
        - name: aws
          user:
            exec:
              apiVersion: client.authentication.k8s.io/v1alpha1
              command: aws-iam-authenticator
              args:
                - "token"
                - "-i"
                - "terraform-eks-demo"
    EOT -> (known after apply)

```
</details>
*Pusher: @yushindkang, Action: `pull_request`*